HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxFlash_bf.h
/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_OFF (11)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_OFF (7)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_OFF (25)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_OFF (27)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_OFF (12)

/** \\brief  Length for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_OFF (1)

/** \\brief  Length for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_OFF (3)

/** \\brief  Length for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_OFF (4)

/** \\brief  Length for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_LEN (29)

/** \\brief  Mask for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_OFF (3)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_OFF (2)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_LEN (16)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_MSK (0xffff)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_OFF (16)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_OFF (3)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_OFF (8)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_OFF (4)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_OFF (1)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_OFF (0)

/** \\brief  Length for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_LEN (32)

/** \\brief  Mask for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_OFF (0)

/** \\brief  Length for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_LEN (32)

/** \\brief  Mask for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_OFF (0)

/** \\brief  Length for Ifx_FLASH_ID_Bits.MOD_REV */
#define IFX_FLASH_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_FLASH_ID_Bits.MOD_REV */
#define IFX_FLASH_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_FLASH_ID_Bits.MOD_REV */
#define IFX_FLASH_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_OFF (0)

/** \\brief  Length for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_OFF (1)

