HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxFlash_bf.h
/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S26ROM */
#define IFX_FLASH_PROCONOTP_S26ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S26ROM */
#define IFX_FLASH_PROCONOTP_S26ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S26ROM */
#define IFX_FLASH_PROCONOTP_S26ROM_OFF (26)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S2ROM */
#define IFX_FLASH_PROCONOTP_S2ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S2ROM */
#define IFX_FLASH_PROCONOTP_S2ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S2ROM */
#define IFX_FLASH_PROCONOTP_S2ROM_OFF (2)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S3ROM */
#define IFX_FLASH_PROCONOTP_S3ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S3ROM */
#define IFX_FLASH_PROCONOTP_S3ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S3ROM */
#define IFX_FLASH_PROCONOTP_S3ROM_OFF (3)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S4ROM */
#define IFX_FLASH_PROCONOTP_S4ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S4ROM */
#define IFX_FLASH_PROCONOTP_S4ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S4ROM */
#define IFX_FLASH_PROCONOTP_S4ROM_OFF (4)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_OFF (5)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_OFF (6)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_OFF (7)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_OFF (8)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_OFF (9)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_OFF (31)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_OFF (31)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_OFF (0)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_OFF (10)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_OFF (11)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_OFF (12)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_OFF (13)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_OFF (14)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_OFF (15)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_OFF (16)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_OFF (17)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_MSK (0x1)

