HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxFlash_bf.h
/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_OFF (18)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_OFF (19)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_OFF (1)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_OFF (20)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_OFF (21)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_OFF (22)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_OFF (23)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_OFF (24)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_OFF (25)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_OFF (26)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_OFF (2)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_OFF (3)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_OFF (4)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_OFF (5)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_OFF (6)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_OFF (7)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S8L */
#define IFX_FLASH_PROCONP_S8L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S8L */
#define IFX_FLASH_PROCONP_S8L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S8L */
#define IFX_FLASH_PROCONP_S8L_OFF (8)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S9L */
#define IFX_FLASH_PROCONP_S9L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S9L */
#define IFX_FLASH_PROCONP_S9L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S9L */
#define IFX_FLASH_PROCONP_S9L_OFF (9)

/** \\brief  Length for Ifx_FLASH_PROCONWOP_Bits.DATM */
#define IFX_FLASH_PROCONWOP_DATM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONWOP_Bits.DATM */
#define IFX_FLASH_PROCONWOP_DATM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONWOP_Bits.DATM */
#define IFX_FLASH_PROCONWOP_DATM_OFF (31)

/** \\brief  Length for Ifx_FLASH_PROCONWOP_Bits.S0WOP */
#define IFX_FLASH_PROCONWOP_S0WOP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S0WOP */
#define IFX_FLASH_PROCONWOP_S0WOP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S0WOP */
#define IFX_FLASH_PROCONWOP_S0WOP_OFF (0)

/** \\brief  Length for Ifx_FLASH_PROCONWOP_Bits.S10WOP */
#define IFX_FLASH_PROCONWOP_S10WOP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S10WOP */
#define IFX_FLASH_PROCONWOP_S10WOP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S10WOP */
#define IFX_FLASH_PROCONWOP_S10WOP_OFF (10)

/** \\brief  Length for Ifx_FLASH_PROCONWOP_Bits.S11WOP */
#define IFX_FLASH_PROCONWOP_S11WOP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S11WOP */
#define IFX_FLASH_PROCONWOP_S11WOP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S11WOP */
#define IFX_FLASH_PROCONWOP_S11WOP_OFF (11)

/** \\brief  Length for Ifx_FLASH_PROCONWOP_Bits.S12WOP */
#define IFX_FLASH_PROCONWOP_S12WOP_LEN (1)

